Tekla.Structures.Drawing.DrawingEnumeratorBase.EnumeratorTypeEnum
The types of enumerator available.

Tekla.Structures.Drawing.DrawingEnumeratorBase.EnumeratorTypeEnum.ALL_SELECTED
Selects all user selected objects from the drawing.

Tekla.Structures.Drawing.DrawingEnumeratorBase.EnumeratorTypeEnum.ALL_OBJECTS
Selects all objects from the drawing.

Tekla.Structures.Drawing.DrawingEnumeratorBase.EnumeratorTypeEnum.PICKED_OBJECTS
Picked objects

Tekla.Structures.Drawing.DrawingEnumeratorBase.EnumeratorTypeEnum.ALL_RELATED_OBJECTS
Related Objects of Object

Tekla.Structures.Drawing.DrawingEnumeratorBase.EnumeratorTypeEnum.OBJECTS_BASED_ON_MODELIDENTIFIER
Objects based on model identifier

Tekla.Structures.Drawing.DrawingEnumeratorBase.EnumeratorTypeEnum.ANNOTATION_OBJECTS
Annotation objects

Tekla.Structures.Drawing.DrawingEnumeratorBase.EnumeratorTypeEnum.ALL_ANNOTATION_SELECTED
Selected annotation objects